#### Terraform Format and Style 🖌`success`

#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>



```


terraform
azurerm_resource_group.init: Refreshing state... [id=/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sandbox-eus]
azurerm_storage_account.init: Refreshing state... [id=/subscriptions/62c223af-3ea4-4cf8-bb4a-c8449fe872e1/resourceGroups/rg-sandbox-eus/providers/Microsoft.Storage/storageAccounts/stsandboxeus]
azurerm_storage_container.init: Refreshing state... [id=https://stsandboxeus.blob.core.windows.net/sandbox]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_lb.example will be created
  + resource "azurerm_lb" "example" {
      + id                   = (known after apply)
      + location             = "eastus"
      + name                 = "lb-sandbox-eus"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg-sandbox-eus"
      + sku                  = "Basic"
      + sku_tier             = "Regional"

      + frontend_ip_configuration {
          + availability_zone                                  = (known after apply)
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "PublicIPAddress"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = (known after apply)
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = (known after apply)
          + zones                                              = (known after apply)
        }
    }

  # azurerm_public_ip.example will be created
  + resource "azurerm_public_ip" "example" {
      + allocation_method       = "Static"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "pip-sandbox-eus"
      + resource_group_name     = "rg-sandbox-eus"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + zones                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```



</details>

*Pushed by: @christianscottost, Action: `pull_request`*